* Analyze potential pumping mechanisms for the O II V1 multiplet 
:PROPERTIES:
:ID:       7571005C-BE84-415D-A102-EE79D2A5DC6F
:END:
+ Relevant levels
  |          | Term             |    wavnum | 2J | Comment                 |       \lambda_0k |      A_k0 |        \sigma |
  |----------+------------------+-----------+----+-------------------------+-----------+----------+----------|
  | Ground   | 2s22p3       4So |         0 |  3 |                         |           |          |        0 |
  |----------+------------------+-----------+----+-------------------------+-----------+----------+----------|
  | 3p ^4D   | 2s22p2(3P)3p 4Do | 206730.76 |  1 | Where we want to get to |           |          |        0 |
  |          |                  | 206786.29 |  3 |                         |           |          |        0 |
  | V1 upper |                  | 206877.86 |  5 |                         |           |          |        0 |
  |          |                  | 207002.48 |  7 |                         |           |          |        0 |
  |----------+------------------+-----------+----+-------------------------+-----------+----------+----------|
  | 3p ^4P   | 2s22p2(3P)3p 4Po | 208346.10 |  1 |                         |           |          |        0 |
  |          |                  | 208392.26 |  3 |                         |           |          |        0 |
  |          |                  | 208484.20 |  5 |                         |           |          |        0 |
  |----------+------------------+-----------+----+-------------------------+-----------+----------+----------|
  | 3d ^4P   | 2s22p2(3P)3d 4Pe | 232462.72 |  5 | 60 % -> 3p ^4P          | 430.17650 | 4.04E+09 | 1.21e-13 |
  |          |                  | 232535.95 |  3 | 9 % -> 3p ^4D **        | 430.04103 | 3.60E+09 | 7.16e-14 |
  |          |                  | 232602.49 |  1 | 27 % -> 3p ^4S          | 429.91801 | 3.40E+09 | 3.38e-14 |
  |----------+------------------+-----------+----+-------------------------+-----------+----------+----------|
  | 3d ^4D   | 2s22p2(3P)3d 4De | 232711.64 |  1 | 67 % -> 3p ^4P          | 429.71636 | 1.28E+09 | 1.27e-14 |
  |          |                  | 232745.98 |  3 | 19 % -> 3p ^4D **       | 429.65296 | 1.06E+09 | 2.10e-14 |
  |          |                  | 232747.56 |  5 | 6 % -> Doublet terms    |           |          |        0 |
  |          |                  | 232753.82 |  7 |                         |           |          |        0 |
  |----------+------------------+-----------+----+-------------------------+-----------+----------+----------|
  | 3d ^4F   |                  |           |    | 97 % -> 3p ^4D_o  **     |           |          |        0 |
  |          |                  | 231350.09 |  5 |                         | 432.24535 | 2.63E+05 | 7.96e-18 |
  |----------+------------------+-----------+----+-------------------------+-----------+----------+----------|
  | 4s ^4P   | 2s22p2(3P)4s 4Pe | 238627.46 |  1 |                         | 419.06325 | 1.86E+08 | 1.71e-15 |
  |          |                  | 238732.65 |  3 |                         | 418.87861 | 1.88E+08 | 3.45e-15 |
  |          |                  | 238893.96 |  5 |                         | 418.59577 | 1.92E+08 | 5.28e-15 |
  #+TBLFM: $8=$6 > 0 ? 0.25 $7 (($4 + 1) / (@I$4 + 1) ) ($6 $ang)**3 / 10 $km : 0 ;s3



** Lists of levels from NIST
*** The ground level
|---------------+------+-----+--------------|
| Configuration | Term | J   | Level (cm-1) |
|---------------+------+-----+--------------|
|               |      |     |              |
| 2s2.2p3       | 4S*  | 3/2 |         0.00 |
|               |      |     |              |
| 2s2.2p3       | 2D*  | 5/2 |     26810.55 |
|               |      | 3/2 |     26830.57 |
|               |      |     |              |
| 2s2.2p3       | 2P*  | 3/2 |     40468.01 |
|               |      | 1/2 |     40470.00 |
|---------------+------+-----+--------------|

*** All the quartet LS coupling terms (without core excitation)
|-----------------+------+-----+--------------|
| Configuration   | Term | J   | Level (cm-1) |
|-----------------+------+-----+--------------|
|                 |      |     |              |
| 2s2.2p3         | 4S*  | 3/2 |         0.00 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).3s | 4P   | 1/2 |   185235.281 |
|                 |      | 3/2 |   185340.577 |
|                 |      | 5/2 |   185499.124 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).3p | 4D*  | 1/2 |   206730.762 |
|                 |      | 3/2 |   206786.286 |
|                 |      | 5/2 |   206877.865 |
|                 |      | 7/2 |   207002.482 |
|                 |      |     |              |
| 2s2.2p2.(3P).3p | 4P*  | 1/2 |   208346.104 |
|                 |      | 3/2 |   208392.258 |
|                 |      | 5/2 |   208484.202 |
|                 |      |     |              |
| 2s2.2p2.(3P).3p | 4S*  | 3/2 |   212161.881 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).3d | 4F   | 3/2 |   231296.126 |
|                 |      | 5/2 |   231350.087 |
|                 |      | 7/2 |   231427.970 |
|                 |      | 9/2 |   231530.246 |
|                 |      |     |              |
| 2s2.2p2.(3P).3d | 4P   | 5/2 |   232462.724 |
|                 |      | 3/2 |   232535.949 |
|                 |      | 1/2 |   232602.492 |
|                 |      |     |              |
| 2s2.2p2.(3P).3d | 4D   | 1/2 |   232711.642 |
|                 |      | 3/2 |   232745.981 |
|                 |      | 5/2 |   232747.562 |
|                 |      | 7/2 |   232753.816 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).4s | 4P   | 1/2 |    238627.46 |
|                 |      | 3/2 |    238732.65 |
|                 |      | 5/2 |    238893.96 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).4p | 4D*  | 1/2 |    245768.37 |
|                 |      | 3/2 |    245816.70 |
|                 |      | 5/2 |   245903.224 |
|                 |      | 7/2 |   246029.295 |
|                 |      |     |              |
| 2s2.2p2.(3P).4p | 4S*  | 3/2 |   246291.822 |
|                 |      |     |              |
| 2s2.2p2.(3P).4p | 4P*  | 1/2 |   246320.086 |
|                 |      | 5/2 |   246455.629 |
|                 |      | 3/2 |   246483.317 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).4d | 4F   | 3/2 |    254337.61 |
|                 |      | 5/2 |    254388.42 |
|                 |      | 7/2 |    254480.20 |
|                 |      | 9/2 |    254590.00 |
|                 |      |     |              |
| 2s2.2p2.(3P).4d | 4D   | 1/2 |    254846.68 |
|                 |      | 3/2 |    254881.37 |
|                 |      | 5/2 |    254896.42 |
|                 |      | 7/2 |    255019.73 |
|                 |      |     |              |
| 2s2.2p2.(3P).4d | 4P   | 5/2 |    255105.01 |
|                 |      | 3/2 |    255142.41 |
|                 |      | 1/2 |    255163.08 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).5s | 4P   | 1/2 |    257695.74 |
|                 |      | 3/2 |    257799.93 |
|                 |      | 5/2 |    257965.11 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).5p | 4D*  | 1/2 |    260911.96 |
|                 |      | 3/2 |    260958.62 |
|                 |      | 5/2 |    261044.03 |
|                 |      | 7/2 |    261180.59 |
|                 |      |     |              |
| 2s2.2p2.(3P).5p | 4P*  | 1/2 |    261214.47 |
|                 |      | 3/2 |    261261.29 |
|                 |      | 5/2 |    261356.02 |
|                 |      |     |              |
| 2s2.2p2.(3P).5p | 4S*  | 3/2 |    261621.56 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).5d | 4D   | 5/2 |     265220.3 |
|                 |      | 3/2 |     265220.3 |
|                 |      |     |              |
| 2s2.2p2.(3P).5d | 4P   | 5/2 |     265431.5 |
|                 |      | 3/2 |     265468.2 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).6s | 4P   | 1/2 |     266698.0 |
|                 |      | 3/2 |     266802.0 |
|                 |      | 5/2 |    266971.23 |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).6p | 4D*  | 1/2 |              |
|                 |      | 3/2 |     268465.6 |
|                 |      | 5/2 |    268547.50 |
|                 |      | 7/2 |     268692.1 |
|                 |      |     |              |
| 2s2.2p2.(3P).6p | 4P*  | 3/2 |              |
|                 |      | 1/2 |              |
|                 |      | 5/2 |    268782.5? |
|                 |      |     |              |
|-----------------+------+-----+--------------|
| 2s2.2p2.(3P).7p | 4D*  | 1/2 |              |
|                 |      | 3/2 |     272728.4 |
|                 |      | 5/2 |     272787.7 |
|                 |      | 7/2 |     272968.4 |
|                 |      |     |              |
| 2s2.2p2.(3P).7p | 4P*  | 1/2 |              |
|                 |      | 3/2 |              |
|                 |      | 5/2 |     273018.7 |
|-----------------+------+-----+--------------|

*** The 4f terms
+ These are the ones that Cesar reckons cannot be fluoresced
+ They are in the strange 
|-------------------+-------+------+--------------|
| Configuration     | Term  | J    | Level (cm-1) |
|-------------------+-------+------+--------------|
|                   |       |      |              |
| 2s2.2p2.(3P).4f D | 2[3]* | 5/2  |   255689.939 |
|                   |       | 7/2  |   255691.346 |
|                   |       |      |              |
| 2s2.2p2.(3P).4f G | 2[3]* | 5/2  |   255756.131 |
|                   |       | 7/2  |   255759.384 |
|                   |       |      |              |
| 2s2.2p2.(3P).4f D | 2[2]* | 3/2  |   255812.728 |
|                   |       | 5/2  |   255813.472 |
|                   |       |      |              |
| 2s2.2p2.(3P).4f G | 2[4]* | 9/2  |   255827.657 |
|                   |       | 7/2  |    255829.58 |
|                   |       |      |              |
| 2s2.2p2.(3P).4f D | 2[1]* | 3/2  |    255912.32 |
|                   |       | 1/2  |    255912.37 |
|                   |       |      |              |
| 2s2.2p2.(3P).4f G | 2[5]* | 11/2 |   255977.481 |
|                   |       | 9/2  |   255983.584 |
|                   |       |      |              |
| 2s2.2p2.(3P).4f F | 2[2]* | 3/2  |   256083.604 |
|                   |       | 5/2  |   256087.746 |
|                   |       |      |              |
| 2s2.2p2.(3P).4f F | 2[3]* | 7/2  |   256123.231 |
|                   |       | 5/2  |   256125.785 |
|                   |       |      |              |
| 2s2.2p2.(3P).4f F | 2[4]* | 9/2  |   256136.036 |
|                   |       | 7/2  |   256143.187 |
|-------------------+-------+------+--------------|

** Cross sections for resonance lines
+ Theory is worked out in Raman scattering notes
  + [[id:EA7894C6-F3D9-4534-A222-767B47129164][Relation between Einstein-A and cross section]]
+ Line center cross section: \sigma(\nu_0) = 1/4 (g_2/g_1) (\lambda_0^3 / \Delta{}V) A_ki
  + Assume \Delta{}V = 10 km/s
+ Cross section of order 5e-15 cm^2 for the most promising 4s ^4P pumping
  + Can be as large as 1.2e-13 cm^2 for 3d ^4P
  + And as small as 1e-17 cm^2 for 3d ^4F
+ Assume O/H = 4e-4
+ We need to calculate the fraction of O+ in the O++ zone
  + This is probably best calculate empirically from [O II]/[O III]
  + Or we could calculate Cloudy models
  + Or I could follow example I did for Turtle
+ Looking at cloudy model ~trap-NH0-19.ovr~
  + Illuminated face has f(O+) ~= 0.1, n ~= 12,000 pcc
+ So mfp(4s ^4P)  = 1 / n \sigma = 1 / 1e4 4e-4 0.1 5e-15 = 5e14 cm
  + This is pretty small compared with depth of O++ zone in model of 5e16 cm
  + mfp(3d ^4F) is 660 x longer: 3.3e17 cm, so that goes all the way to the O+ zone 
+ To compare with BG opacity, we calculate the x-section per hydrogen nucleon \sigma/H
  + \sigma/H = (O/H) (O+/O) \sigma = 4e-5 \sigma
    + 2e-19 cm^2/H for 4s ^4P
    + 5e-18 cm^2/H for 3d ^4P
    + 4e-22 cm^2/H for 3d ^4F
+ Background continuum opacity
  + H0 opacity: \sigma/H = (H0/H) 6e-18 (\lambda/912)**3
    + High-ionization zone has H0/H = 3e-4 => \sigma/H = 2e-22 cm^2/H
    + Low-ionization zone (O+/O \approx 0.5) has H0/H = 1e-3 => \sigma/H = 6e-22 cm^2/H
  + He0 opacity: \sigma/H = (He0/He) (He/H) 8e-18 (\lambda/507)**3
    + High-ionization zone has He0/He = 1.3e-3  =>  \sigma/H = 6e-22 cm^2/H
    + Low-ionization zone has He0/He = 5.6e-3 =>  \sigma/H = 3e-21 cm^2/H
  + Dust opacity: \sigma/H = 5e-22 cm^2/H for standard ISM dust at 420 \AA, but may be a few times less in Orion
  + Conclusions on opacity
    + He0 dominates but H0 and dust contribute 30% or so
    + Total: \sigma/H \approx 1e-21 cm^2/H in high ionization zone
    + Total: \sigma/H \approx 4e-21 cm^2/H in low ionization zone
*** Why does Grandi say that star light pumping is not important for O II
+ Quote from Grandi:1976a
  : Lines of O II are numerous in the spectrum of the Orion Nebula, and, as is apparent from the presence of many lines that are quite unlikely to be excited by resonance fluorescence, recombination appears to be the only plausible excitation mechanism.
  + What he is saying here is that the lines from upper-states with high-L do not have a direct route to be radiatively excited from the ground state.
  + Examples would be the 3d-4f lines that Cesar mentioned
+ Grandi continues:
  : This conclusion is confirmed by the calculations whose results appear in Table 2. Starlight resonance fluorescence is of largely negligible importance because O II is not abundant in the nebula except near the transition region where H and He are becoming neutral; consequently the opacity in the O II resonance lines due to H I and He I is quite large
  + But we find above that the pumping *is* efficient in the O++ zone 
** Direct pumping of 3p ^4D_o - is it possible?
+ No, because has same parity as the ground state
+ J=1/2 state: 93% V1
  |  wav(vac) |  wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |
  |-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
  | 4652.1406 | 4650.8384 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 4P-4Do | 1/2 | 1/2 | 6.90E+07 | 185235.28 | 206730.76 | 0.794931 |
  | 4675.0414 | 4673.7331 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 4P-4Do | 3/2 | 1/2 | 1.21E+07 | 185340.58 | 206730.76 | 0.139401 |
  | 1154.0960 |           | 2s.2p4          | 2s2.2p2.(3P).3p | 4P-4Do | 1/2 | 1/2 | 5.00E+06 | 120082.86 | 206730.76 | 0.057604 |
  | 1152.9992 |           | 2s.2p4          | 2s2.2p2.(3P).3p | 4P-4Do | 3/2 | 1/2 | 7.04E+05 | 120000.43 | 206730.76 | 0.008111 |
  | 5604.6840 | 5603.1285 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 2P-4Do | 1/2 | 1/2 | 1.30E+03 | 188888.54 | 206730.76 | 0.000015 |
  |  2454.936 |  2454.193 | 2s.2p4          | 2s2.2p2.(3P).3p | 2D-4Do | 3/2 | 1/2 | 6.77E+02 | 165996.50 | 206730.76 | 0.000008 |
  |   9074.17 |           | 2s.2p4          | 2s2.2p2.(3P).3p | 2S-4Do | 1/2 | 1/2 | 8.90E+01 | 195710.47 | 206730.76 | 0.000001 |
  | 5661.7934 | 5660.2226 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 2P-4Do | 3/2 | 1/2 | 8.17E+01 | 189068.51 | 206730.76 | 0.000001 |
  |-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
  |           |           |                 |                 |        |     |     |   8.68e7 |           |           | 1.000000 |
  #+TBLFM: $11=$8 / @10$8;%.6f::@10$8=vsum(@I..@II);s3
+ J=3/2 state: 95% goes into V1
  |  wav(vac) |  wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |
  |-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
  | 4662.9375 | 4661.6324 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 4P-4Do | 3/2 | 3/2 | 4.14E+07 | 185340.58 | 206786.29 | 0.475862 |
  | 4640.1548 | 4638.8558 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 4P-4Do | 1/2 | 3/2 | 3.67E+07 | 185235.28 | 206786.29 | 0.421839 |
  | 4697.6671 | 4696.3528 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 4P-4Do | 5/2 | 3/2 | 3.15E+06 | 185499.12 | 206786.29 | 0.036207 |
  | 1153.3570 |           | 2s.2p4          | 2s2.2p2.(3P).3p | 4P-4Do | 1/2 | 3/2 | 2.89E+06 | 120082.86 | 206786.29 | 0.033218 |
  | 1152.2615 |           | 2s.2p4          | 2s2.2p2.(3P).3p | 4P-4Do | 3/2 | 3/2 | 2.72E+06 | 120000.43 | 206786.29 | 0.031264 |
  | 1150.0985 |           | 2s.2p4          | 2s2.2p2.(3P).3p | 4P-4Do | 5/2 | 3/2 | 1.28E+05 | 119837.21 | 206786.29 | 0.001471 |
  | 5587.2967 | 5585.7458 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 2P-4Do | 1/2 | 3/2 | 1.92E+03 | 188888.54 | 206786.29 | 0.000022 |
  | 5644.0505 | 5642.4844 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 2P-4Do | 3/2 | 3/2 | 8.36E+02 | 189068.51 | 206786.29 | 0.000010 |
  |  2451.111 |  2450.369 | 2s.2p4          | 2s2.2p2.(3P).3p | 2D-4Do | 5/2 | 3/2 | 2.91E+02 | 165988.46 | 206786.29 | 0.000003 |
  |   9028.68 |   9026.20 | 2s.2p4          | 2s2.2p2.(3P).3p | 2S-4Do | 1/2 | 3/2 | 4.68E+01 | 195710.47 | 206786.29 | 0.000001 |
  |  2451.594 |  2450.852 | 2s.2p4          | 2s2.2p2.(3P).3p | 2D-4Do | 3/2 | 3/2 | 3.47E+00 | 165996.50 | 206786.29 | 0.000000 |
  |-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
  |           |           |                 |                 |        |     |     |   8.70e7 |           |           | 1.000000 |
  #+TBLFM: $11=$8 / @13$8;%.6f::@13$8=vsum(@I..@II);s3
+ J=5/2 state: 94% goes to V1
  |  wav(vac) |  wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |
  |-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
  | 4643.1101 | 4641.8103 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 4P-4Do | 3/2 | 5/2 | 6.01E+07 | 185340.58 | 206877.86 | 0.690011 |
  | 4677.5439 | 4676.2350 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 4P-4Do | 5/2 | 5/2 | 2.12E+07 | 185499.12 | 206877.86 | 0.243398 |
  | 1151.0469 |           | 2s.2p4          | 2s2.2p2.(3P).3p | 4P-4Do | 3/2 | 5/2 | 4.59E+06 | 120000.43 | 206877.86 | 0.052698 |
  | 1148.8884 |           | 2s.2p4          | 2s2.2p2.(3P).3p | 4P-4Do | 5/2 | 5/2 | 1.17E+06 | 119837.21 | 206877.86 | 0.013433 |
  | 5615.0277 | 5613.4694 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 2P-4Do | 3/2 | 5/2 | 3.65E+03 | 189068.51 | 206877.86 | 0.000042 |
  |  2446.102 |  2445.361 | 2s.2p4          | 2s2.2p2.(3P).3p | 2D-4Do | 3/2 | 5/2 | 2.20E+02 | 165996.50 | 206877.86 | 0.000003 |
  |  2445.621 |  2444.880 | 2s.2p4          | 2s2.2p2.(3P).3p | 2D-4Do | 5/2 | 5/2 | 6.41E+01 | 165988.46 | 206877.86 | 0.000001 |
  |-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
  |           |           |                 |                 |        |     |     |   8.71e7 |           |           | 1.000000 |
  #+TBLFM: $11=$8 / @9$8;%.6f::@9$8=vsum(@I..@II);s3
+ J=7/2 state:
 |  wav(vac) |  wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |
 |-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
 | 1147.2459 |           | 2s.2p4          | 2s2.2p2.(3P).3p | 4P-4Do | 5/2 | 7/2 | 5.70E+06 | 119837.21 | 207002.48 | 0.065442 |
 |  2438.191 |  2437.451 | 2s.2p4          | 2s2.2p2.(3P).3p | 2D-4Do | 5/2 | 7/2 | 1.18E+03 | 165988.46 | 207002.48 | 0.000014 |
 | 4650.4365 | 4649.1347 | 2s2.2p2.(3P).3s | 2s2.2p2.(3P).3p | 4P-4Do | 5/2 | 7/2 | 8.14E+07 | 185499.12 | 207002.48 | 0.934558 |
 |  3247000. |  3246000. | 2s2.2p2.(1D).3s | 2s2.2p2.(3P).3p | 2D-4Do | 5/2 | 7/2 | 5.46E-11 | 206971.68 | 207002.48 | 0.000000 |
 |-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
 |           |           |                 |                 |        |     |     |   8.71e7 |           |           | 1.000000 |
 #+TBLFM: $11=$8 / @6$8;%.6f::@6$8=vsum(@I..@II);s3


** All lines coming down to 3p ^4D_o
+ The top-listed of these
|  wav(vac) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |
|-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------|
| 4073.3023 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4F | 5/2 | 7/2 | 1.71E+08 | 206877.86 | 231427.97 |
| 4071.0312 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4F | 3/2 | 5/2 | 1.51E+08 | 206786.29 | 231350.09 |
| 4070.7722 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4F | 1/2 | 3/2 | 1.40E+08 | 206730.76 | 231296.13 |
|  3139.246 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 5/2 | 3/2 | 1.00E+08 | 206877.86 | 238732.65 |
|  3140.588 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 3/2 | 1/2 | 8.14E+07 | 206786.29 | 238627.46 |
|  3135.121 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 1/2 | 1/2 | 7.75E+07 | 206730.76 | 238627.46 |
| 4079.9940 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4F | 3/2 | 3/2 | 5.18E+07 | 206786.29 | 231296.13 |
|  3130.247 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 3/2 | 3/2 | 4.69E+07 | 206786.29 | 238732.65 |
| 4086.2656 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4F | 5/2 | 5/2 | 4.29E+07 | 206877.86 | 231350.09 |
|-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------|
| 1963.7852 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5s | 4Do-4P | 5/2 | 3/2 | 3.70E+07 | 206877.86 | 257799.93 |
| 1962.1317 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5s | 4Do-4P | 1/2 | 1/2 | 2.95E+07 | 206730.76 | 257695.74 |
| 1964.2717 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5s | 4Do-4P | 3/2 | 1/2 | 2.94E+07 | 206786.29 | 257695.74 |
|  3123.429 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 5/2 | 5/2 | 2.45E+07 | 206877.86 | 238893.96 |
| 3857.2277 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 3/2 | 1/2 | 2.29E+07 | 206786.29 | 232711.64 |
|  1668.777 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).6s | 4Do-4P | 5/2 | 3/2 | 1.89E+07 | 206877.86 | 266802.00 |
| 1960.2599 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5s | 4Do-4P | 3/2 | 3/2 | 1.89E+07 | 206786.29 | 257799.93 |
| 3865.7628 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 5/2 | 3/2 | 1.89E+07 | 206877.86 | 232745.98 |
| 3865.5265 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 5/2 | 5/2 | 1.76E+07 | 206877.86 | 232747.56 |
|  1667.577 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).6s | 4Do-4P | 1/2 | 1/2 | 1.50E+07 | 206730.76 | 266698.00 |
|  1669.123 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).6s | 4Do-4P | 3/2 | 1/2 | 1.50E+07 | 206786.29 | 266698.00 |
| 3848.9843 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 1/2 | 1/2 | 1.45E+07 | 206730.76 | 232711.64 |
| 3852.1254 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 3/2 | 3/2 | 1.35E+07 | 206786.29 | 232745.98 |
| 3865.2228 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 1/2 | 1/2 | 1.24E+07 | 206730.76 | 232602.49 |
| 1957.4358 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5s | 4Do-4P | 5/2 | 5/2 | 1.07E+07 | 206877.86 | 257965.11 |
| 3883.5460 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 3/2 | 3/2 | 1.00E+07 | 206786.29 | 232535.95 |
|  1666.230 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).6s | 4Do-4P | 3/2 | 3/2 | 9.62E+06 | 206786.29 | 266802.00 |
| 3908.5617 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 5/2 | 5/2 | 9.56E+06 | 206877.86 | 232462.72 |
| 3858.2579 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2F | 5/2 | 5/2 | 8.22E+06 | 206877.86 | 232796.30 |
| 3843.9038 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 1/2 | 3/2 | 7.99E+06 | 206730.76 | 232745.98 |
|  3124.816 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 1/2 | 3/2 | 6.96E+06 | 206730.76 | 238732.65 |
| 3864.5923 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 5/2 | 7/2 | 5.66E+06 | 206877.86 | 232753.82 |
| 1664.0772 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).6s | 4Do-4P | 5/2 | 5/2 | 5.43E+06 | 206877.86 | 266971.23 |
| 3851.8908 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 3/2 | 5/2 | 4.79E+06 | 206786.29 | 232747.56 |
| 3844.6734 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2F | 3/2 | 5/2 | 4.15E+06 | 206786.29 | 232796.30 |
| 3875.1899 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 1/2 | 3/2 | 4.09E+06 | 206730.76 | 232535.95 |
| 3873.5359 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 3/2 | 1/2 | 4.04E+06 | 206786.29 | 232602.49 |
| 4095.2957 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4F | 5/2 | 3/2 | 3.23E+06 | 206877.86 | 231296.13 |
| 1958.1286 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5s | 4Do-4P | 1/2 | 3/2 | 2.96E+06 | 206730.76 | 257799.93 |
|  3114.520 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 3/2 | 5/2 | 2.47E+06 | 206786.29 | 238893.96 |
| 3894.6212 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 3/2 | 5/2 | 2.22E+06 | 206786.29 | 232462.72 |
|  1664.690 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).6s | 4Do-4P | 1/2 | 3/2 | 1.51E+06 | 206730.76 | 266802.00 |
| 3897.4071 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 5/2 | 3/2 | 1.50E+06 | 206877.86 | 232535.95 |
| 2100.7373 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4F | 5/2 | 7/2 | 1.40E+06 | 206877.86 | 254480.20 |
| 2100.7462 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4F | 3/2 | 5/2 | 1.22E+06 | 206786.29 | 254388.42 |
| 1953.9331 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5s | 4Do-4P | 3/2 | 5/2 | 1.19E+06 | 206786.29 | 257965.11 |
| 2100.5381 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4F | 1/2 | 3/2 | 1.14E+06 | 206730.76 | 254337.61 |
| 3834.1581 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2F | 5/2 | 7/2 | 1.03E+06 | 206877.86 | 232959.21 |
| 1661.5451 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).6s | 4Do-4P | 3/2 | 5/2 | 6.06E+05 | 206786.29 | 266971.23 |
| 2102.9909 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4F | 3/2 | 3/2 | 4.56E+05 | 206786.29 | 254337.61 |
|  1714.018 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5d | 4Do-4D | 5/2 | 5/2 | 4.03E+05 | 206877.86 | 265220.30 |
| 2104.7955 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4F | 5/2 | 5/2 | 3.96E+05 | 206877.86 | 254388.42 |
|  1706.766 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5d | 4Do-4P | 5/2 | 3/2 | 3.20E+05 | 206877.86 | 265468.20 |
|  1711.332 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5d | 4Do-4D | 3/2 | 3/2 | 2.81E+05 | 206786.29 | 265220.30 |
| 2071.9143 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4P | 5/2 | 3/2 | 2.64E+05 | 206877.86 | 255142.41 |
|  1714.018 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5d | 4Do-4D | 5/2 | 3/2 | 2.45E+05 | 206877.86 | 265220.30 |
| 2064.7370 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4P | 1/2 | 1/2 | 2.12E+05 | 206730.76 | 255163.08 |
| 2067.1068 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4P | 3/2 | 1/2 | 2.11E+05 | 206786.29 | 255163.08 |
|  1709.707 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5d | 4Do-4D | 1/2 | 3/2 | 1.76E+05 | 206730.76 | 265220.30 |
|  1711.332 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5d | 4Do-4D | 3/2 | 5/2 | 1.64E+05 | 206786.29 | 265220.30 |
|  1704.103 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5d | 4Do-4P | 3/2 | 3/2 | 1.63E+05 | 206786.29 | 265468.20 |
| 2067.9904 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4P | 3/2 | 3/2 | 1.35E+05 | 206786.29 | 255142.41 |
|  3737.158 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2P | 3/2 | 1/2 | 1.11E+05 | 206786.29 | 233544.59 |
|  2972.697 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-2P | 5/2 | 3/2 | 1.00E+05 | 206877.86 | 240517.35 |
|  1707.836 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5d | 4Do-4P | 5/2 | 5/2 | 9.12E+04 | 206877.86 | 265431.50 |
| 2073.5210 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4P | 5/2 | 5/2 | 7.52E+04 | 206877.86 | 255105.01 |
|  3729.419 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2P | 1/2 | 1/2 | 6.83E+04 | 206730.76 | 233544.59 |
|  3745.351 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2P | 1/2 | 3/2 | 6.49E+04 | 206730.76 | 233430.53 |
|  3766.100 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2P | 5/2 | 3/2 | 5.65E+04 | 206877.86 | 233430.53 |
|  2981.184 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-2P | 3/2 | 1/2 | 5.41E+04 | 206786.29 | 240330.01 |
|  2976.257 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-2P | 1/2 | 1/2 | 4.70E+04 | 206730.76 | 240330.01 |
|  3753.156 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2P | 3/2 | 3/2 | 4.11E+04 | 206786.29 | 233430.53 |
|  2964.626 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-2P | 3/2 | 3/2 | 3.82E+04 | 206786.29 | 240517.35 |
| 2107.0488 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4F | 5/2 | 3/2 | 3.24E+04 | 206877.86 | 254337.61 |
|  1702.492 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5d | 4Do-4P | 1/2 | 3/2 | 2.56E+04 | 206730.76 | 265468.20 |
| 2065.6186 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4P | 1/2 | 3/2 | 2.11E+04 | 206730.76 | 255142.41 |
| 3621.0222 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2D | 3/2 | 3/2 | 1.60E+04 | 206786.29 | 234402.80 |
| 3626.2406 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2D | 5/2 | 5/2 | 1.60E+04 | 206877.86 | 234454.63 |
|  1705.169 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).5d | 4Do-4P | 3/2 | 5/2 | 1.02E+04 | 206786.29 | 265431.50 |
| 2069.5911 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4P | 3/2 | 5/2 | 8.40E+03 | 206786.29 | 255105.01 |
| 3613.7566 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2D | 1/2 | 3/2 | 6.07E+03 | 206730.76 | 234402.80 |
| 2082.5283 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4D | 5/2 | 5/2 | 4.67E+03 | 206877.86 | 254896.42 |
| 2078.3143 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4D | 1/2 | 1/2 | 4.08E+03 | 206730.76 | 254846.68 |
| 2080.7154 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4D | 3/2 | 1/2 | 4.07E+03 | 206786.29 | 254846.68 |
| 3633.0698 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2D | 5/2 | 3/2 | 3.81E+03 | 206877.86 | 234402.80 |
| 2079.2146 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4D | 3/2 | 3/2 | 3.26E+03 | 206786.29 | 254881.37 |
| 2083.1812 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4D | 5/2 | 3/2 | 2.84E+03 | 206877.86 | 254881.37 |
|  2959.754 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-2P | 1/2 | 3/2 | 2.28E+03 | 206730.76 | 240517.35 |
| 2076.8170 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4D | 1/2 | 3/2 | 2.04E+03 | 206730.76 | 254881.37 |
| 2078.5642 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4D | 3/2 | 5/2 | 1.90E+03 | 206786.29 | 254896.42 |
| 2077.1941 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4d | 4Do-4D | 5/2 | 7/2 | 1.17E+03 | 206877.86 | 255019.73 |
| 3614.2382 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-2D | 3/2 | 5/2 | 7.96E+02 | 206786.29 | 234454.63 |
|  4187.835 | 2s2.2p2.(3P).3p | 2s2.2p2.(1S).3s | 4Do-2S | 1/2 | 1/2 | 1.64E+02 | 206730.76 | 230609.45 |
|  4197.595 | 2s2.2p2.(3P).3p | 2s2.2p2.(1S).3s | 4Do-2S | 3/2 | 1/2 | 1.28E+02 | 206786.29 | 230609.45 |
|  16733.70 | 2s2.2p2.(3P).3p | 2s.2p4          | 4Do-2P | 3/2 | 1/2 | 1.42E+01 | 206786.29 | 212762.25 |
|  17494.89 | 2s2.2p2.(3P).3p | 2s.2p4          | 4Do-2P | 5/2 | 3/2 | 1.09E+01 | 206877.86 | 212593.82 |
|  16579.66 | 2s2.2p2.(3P).3p | 2s.2p4          | 4Do-2P | 1/2 | 1/2 | 8.52E+00 | 206730.76 | 212762.25 |
|  17055.95 | 2s2.2p2.(3P).3p | 2s.2p4          | 4Do-2P | 1/2 | 3/2 | 2.18E+00 | 206730.76 | 212593.82 |
|  17219.01 | 2s2.2p2.(3P).3p | 2s.2p4          | 4Do-2P | 3/2 | 3/2 | 2.00E-01 | 206786.29 | 212593.82 |
|   413290. | 2s2.2p2.(3P).3p | 2s2.2p2.(1D).3s | 4Do-2D | 1/2 | 3/2 | 1.97E-04 | 206730.76 | 206972.72 |
|   536380. | 2s2.2p2.(3P).3p | 2s2.2p2.(1D).3s | 4Do-2D | 3/2 | 3/2 | 1.27E-04 | 206786.29 | 206972.72 |
|   539390. | 2s2.2p2.(3P).3p | 2s2.2p2.(1D).3s | 4Do-2D | 3/2 | 5/2 | 1.60E-05 | 206786.29 | 206971.68 |
|  1065900. | 2s2.2p2.(3P).3p | 2s2.2p2.(1D).3s | 4Do-2D | 5/2 | 5/2 | 1.20E-05 | 206877.86 | 206971.68 |
|  1054200. | 2s2.2p2.(3P).3p | 2s2.2p2.(1D).3s | 4Do-2D | 5/2 | 3/2 | 1.48E-06 | 206877.86 | 206972.72 |
|-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------|
|           |                 |                 |        |     |     |   8.63e8 |           |           |
|           |                 |                 |        |     |     |   4.04e8 |           |           |
#+TBLFM: @105$7=vsum(@I..@II);s3::@106$7=vsum(@II..@III);s3


** Pumping via 4s ^4P level
+ This looks promising!
  + Quite a strong resonance line A = 1.9e8 /s as compared with 4e9 and 1.2e9 for 3d ^4P and 3d ^4D 

|  wav(vac) | wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
| 419.06325 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 4So-4P | 3/2 | 1/2 | 1.86E+08 |      0.00 | 238627.46 | 0.417040 |
|  3140.588 | 3139.678 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 3/2 | 1/2 | 8.14E+07 | 206786.29 | 238627.46 | 0.182511 |
|  3135.121 | 3134.213 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 1/2 | 1/2 | 7.75E+07 | 206730.76 | 238627.46 | 0.173767 |
|  3307.403 | 3306.451 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Po-4P | 3/2 | 1/2 | 5.67E+07 | 208392.26 | 238627.46 | 0.127130 |
|  3778.493 | 3777.420 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4So-4P | 3/2 | 1/2 | 3.31E+07 | 212161.88 | 238627.46 | 0.074215 |
|  3302.362 | 3301.411 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Po-4P | 1/2 | 1/2 | 1.06E+07 | 208346.10 | 238627.46 | 0.023767 |
| 504.64918 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 2Po-4P | 1/2 | 1/2 | 4.96E+05 |  40470.00 | 238627.46 | 0.001112 |
| 504.64411 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 2Po-4P | 3/2 | 1/2 | 3.38E+05 |  40468.01 | 238627.46 | 0.000758 |
|  2883.076 | 2882.231 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2So-4P | 1/2 | 1/2 | 1.03E+05 | 203942.29 | 238627.46 | 0.000231 |
|  3689.310 | 3688.260 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2Do-4P | 3/2 | 1/2 | 4.94E+04 | 211522.12 | 238627.46 | 0.000111 |
| 472.15046 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 2Do-4P | 3/2 | 1/2 | 4.69E+04 |  26830.57 | 238627.46 | 0.000105 |
|  4088.719 | 4087.565 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2Po-4P | 1/2 | 1/2 | 4.89E+03 | 214169.92 | 238627.46 | 0.000011 |
|  4098.732 | 4097.576 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2Po-4P | 3/2 | 1/2 | 4.54E+03 | 214229.67 | 238627.46 | 0.000010 |
|  11548.65 | 11545.49 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Do-4P | 3/2 | 1/2 | 1.37E+03 | 229968.44 | 238627.46 | 0.000003 |
|  16268.05 | 16263.60 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Po-4P | 1/2 | 1/2 | 1.50E+02 | 232480.44 | 238627.46 | 0.000000 |
|  16392.45 | 16387.97 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Po-4P | 3/2 | 1/2 | 2.95E+01 | 232527.09 | 238627.46 | 0.000000 |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
|           |          |                 |                 |        |     |     |   4.46e8 |           |           | 1.000000 |
#+TBLFM: $11=$8 / @18$8;%.6f::@18$8=vsum(@I..@II);s3

|  wav(vac) | wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
| 418.87861 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 4So-4P | 3/2 | 3/2 | 1.88E+08 |      0.00 | 238732.65 | 0.419643 |
|  3139.246 | 3138.337 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 5/2 | 3/2 | 1.00E+08 | 206877.86 | 238732.65 | 0.223214 |
|  3130.247 | 3129.340 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 3/2 | 3/2 | 4.69E+07 | 206786.29 | 238732.65 | 0.104688 |
|  3763.534 | 3762.465 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4So-4P | 3/2 | 3/2 | 3.44E+07 | 212161.88 | 238732.65 | 0.076786 |
|  3290.930 | 3289.982 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Po-4P | 1/2 | 3/2 | 3.05E+07 | 208346.10 | 238732.65 | 0.068080 |
|  3305.955 | 3305.003 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Po-4P | 5/2 | 3/2 | 2.79E+07 | 208484.20 | 238732.65 | 0.062277 |
|  3295.936 | 3294.987 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Po-4P | 3/2 | 3/2 | 1.22E+07 | 208392.26 | 238732.65 | 0.027232 |
|  3124.816 | 3123.910 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 1/2 | 3/2 | 6.96E+06 | 206730.76 | 238732.65 | 0.015536 |
| 504.37637 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 2Po-4P | 3/2 | 3/2 | 1.12E+06 |  40468.01 | 238732.65 | 0.002500 |
| 504.38144 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 2Po-4P | 1/2 | 3/2 | 2.02E+05 |  40470.00 | 238732.65 | 0.000451 |
|  2874.359 | 2873.516 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2So-4P | 1/2 | 3/2 | 1.56E+05 | 203942.29 | 238732.65 | 0.000348 |
| 471.87150 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 2Do-4P | 5/2 | 3/2 | 5.95E+04 |  26810.55 | 238732.65 | 0.000133 |
|  3700.973 | 3699.921 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2Do-4P | 5/2 | 3/2 | 5.14E+04 | 211712.73 | 238732.65 | 0.000115 |
| 471.91609 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 2Do-4P | 3/2 | 3/2 | 1.95E+04 |  26830.57 | 238732.65 | 0.000044 |
|  3675.047 | 3674.001 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2Do-4P | 3/2 | 3/2 | 1.18E+04 | 211522.12 | 238732.65 | 0.000026 |
|  4081.136 | 4079.985 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2Po-4P | 3/2 | 3/2 | 1.02E+04 | 214229.67 | 238732.65 | 0.000023 |
|  4071.209 | 4070.059 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2Po-4P | 1/2 | 3/2 | 3.82E+03 | 214169.92 | 238732.65 | 0.000009 |
|  11382.29 | 11379.17 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Do-4P | 5/2 | 3/2 | 2.13E+03 | 229947.07 | 238732.65 | 0.000005 |
|  16114.58 | 16110.18 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Po-4P | 3/2 | 3/2 | 2.59E+02 | 232527.09 | 238732.65 | 0.000001 |
|  11410.04 | 11406.92 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Do-4P | 3/2 | 3/2 | 2.35E+02 | 229968.44 | 238732.65 | 0.000001 |
|  15994.34 | 15989.98 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Po-4P | 1/2 | 3/2 | 5.36E+01 | 232480.44 | 238732.65 | 0.000000 |
|   9991.20 |  9988.46 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Fo-4P | 5/2 | 3/2 | 9.87E-03 | 228723.84 | 238732.65 | 0.000000 |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
|           |          |                 |                 |        |     |     |   4.48e8 |           |           | 1.000000 |
#+TBLFM: $11=$8 / @24$8;%.6f::@24$8=vsum(@I..@II);s3

|  wav(vac) | wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
| 418.59577 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 4So-4P | 3/2 | 5/2 | 1.92E+08 |      0.00 | 238893.96 | 0.424779 |
|  3135.634 | 3134.726 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 7/2 | 5/2 | 1.22E+08 | 207002.48 | 238893.96 | 0.269912 |
|  3288.418 | 3287.471 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Po-4P | 5/2 | 5/2 | 5.32E+07 | 208484.20 | 238893.96 | 0.117699 |
|  3740.824 | 3739.761 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4So-4P | 3/2 | 5/2 | 3.66E+07 | 212161.88 | 238893.96 | 0.080973 |
|  3123.429 | 3122.524 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 5/2 | 5/2 | 2.45E+07 | 206877.86 | 238893.96 | 0.054204 |
|  3278.506 | 3277.561 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Po-4P | 3/2 | 5/2 | 2.09E+07 | 208392.26 | 238893.96 | 0.046239 |
|  3114.520 | 3113.617 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 4Do-4P | 3/2 | 5/2 | 2.47E+06 | 206786.29 | 238893.96 | 0.005465 |
| 471.51260 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 2Do-4P | 5/2 | 5/2 | 2.85E+04 |  26810.55 | 238893.96 | 0.000063 |
|  3679.010 | 3677.962 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2Do-4P | 5/2 | 5/2 | 1.56E+04 | 211712.73 | 238893.96 | 0.000035 |
|  3653.389 | 3652.349 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2Do-4P | 3/2 | 5/2 | 3.34E+03 | 211522.12 | 238893.96 | 0.000007 |
| 471.55711 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 2Do-4P | 3/2 | 5/2 | 1.98E+03 |  26830.57 | 238893.96 | 0.000004 |
| 503.96634 |          | 2s2.2p3         | 2s2.2p2.(3P).4s | 2Po-4P | 3/2 | 5/2 | 1.55E+03 |  40468.01 | 238893.96 | 0.000003 |
|  4054.445 | 4053.300 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).4s | 2Po-4P | 3/2 | 5/2 | 9.29E+02 | 214229.67 | 238893.96 | 0.000002 |
|   9855.61 |  9852.90 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Fo-4P | 7/2 | 5/2 | 3.83E+00 | 228747.45 | 238893.96 | 0.000000 |
|  11177.07 | 11174.01 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Do-4P | 5/2 | 5/2 | 6.21E-01 | 229947.07 | 238893.96 | 0.000000 |
|   9832.73 |  9830.03 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Fo-4P | 5/2 | 5/2 | 2.32E-01 | 228723.84 | 238893.96 | 0.000000 |
|  15706.30 | 15702.01 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Po-4P | 3/2 | 5/2 | 2.48E-02 | 232527.09 | 238893.96 | 0.000000 |
|  11203.83 | 11200.76 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).4s | 2Do-4P | 3/2 | 5/2 | 3.49E-03 | 229968.44 | 238893.96 | 0.000000 |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
|           |          |                 |                 |        |     |     |   4.52e8 |           |           | 1.000000 |
#+TBLFM: $11=$8 / @20$8;%.6f::@20$8=vsum(@I..@II);s3


** Pumping via 3d ^4F level
+ This is a very weak pumping line: A = 2.6e5 s^{-1}
+ But has the advantage that it funnels 97% into 3p ^4D_o
|  wav(vac) |           | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |          |
|-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
| 432.24535 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 4So-4F | 3/2 | 5/2 | 2.63E+05 |      0.00 | 231350.09 | 0.001322 |
|-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
| 4071.0312 | 4069.8819 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4F | 3/2 | 5/2 | 1.51E+08 | 206786.29 | 231350.09 | 0.758794 |
| 4086.2656 | 4085.1124 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4F | 5/2 | 5/2 | 4.29E+07 | 206877.86 | 231350.09 | 0.215578 |
| 488.95089 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4F | 3/2 | 5/2 | 2.59E+06 |  26830.57 | 231350.09 | 0.013015 |
| 4107.1802 | 4106.0214 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4F | 7/2 | 5/2 | 1.39E+06 | 207002.48 | 231350.09 | 0.006985 |
| 488.90303 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4F | 5/2 | 5/2 | 6.52E+05 |  26810.55 | 231350.09 | 0.003276 |
| 523.88365 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4F | 3/2 | 5/2 | 9.35E+04 |  40468.01 | 231350.09 | 0.000470 |
| 5043.3806 | 5041.9747 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4F | 3/2 | 5/2 | 7.18E+04 | 211522.12 | 231350.09 | 0.000361 |
| 4355.8126 | 4354.5886 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4F | 3/2 | 5/2 | 3.01E+04 | 208392.26 | 231350.09 | 0.000151 |
| 5092.3355 | 5090.9165 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4F | 5/2 | 5/2 | 1.14E+04 | 211712.73 | 231350.09 | 0.000057 |
| 4373.3273 | 4372.0987 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4F | 5/2 | 5/2 | 4.66E+03 | 208484.20 | 231350.09 | 0.000023 |
| 5211.5346 | 5210.0839 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4So-4F | 3/2 | 5/2 | 1.75E+03 | 212161.88 | 231350.09 | 0.000009 |
|  5840.980 | 5839.3608 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4F | 3/2 | 5/2 | 7.90E+02 | 214229.67 | 231350.09 | 0.000004 |
|    72377. |    72358. | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4F | 3/2 | 5/2 | 3.50E+00 | 229968.44 | 231350.09 | 0.000000 |
|    71275. |    71256. | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4F | 5/2 | 5/2 | 8.77E-01 | 229947.07 | 231350.09 | 0.000000 |
|   38077.1 |   38066.8 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Fo-4F | 5/2 | 5/2 | 1.63E-01 | 228723.84 | 231350.09 | 0.000000 |
|   38422.6 |   38412.1 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Fo-4F | 7/2 | 5/2 | 1.58E-02 | 228747.45 | 231350.09 | 0.000000 |
|-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------|
|           |           |                 |                 |        |     |     |   1.99e8 |           |           | 1.000000 |
#+TBLFM: $11=$8 / @19$8;%.6f::@19$8=vsum(@II..@III);s3

** Downward transitions from 3d ^4D
+ Branching ratios for J_k = 1/2:
  + Ground: 86 %
  + Discounting ground:
    + 3p ^4P: 0.053624 + 0.037315 = 0.090939 = 64.5 % 
    + 3p ^4D: 0.015369 + 0.009732 = 0.025101 = *17.8 %*
    + 3p ^4S: 0.012752 = 9 %
    + Doublet terms: 9 %
+ Branching ratios for J_k = 3/2:
  + Ground: 84 %
  + Discounting ground:
    + 3p ^4P: 0.072143 + 0.025397 + 0.011746 = 0.090939 = 68.8 % 
    + 3p ^4D: 0.015000 + 0.010714 + 0.006341 = 0.025101 = *20.2 %*
    + 3p ^4S: 0.012698 = 8 %
    + Doublet terms: 3 %

|  wav(vac) | wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |    |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
| 429.71636 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 4So-4D | 3/2 | 1/2 | 1.28E+09 |      0.00 | 232711.64 | 0.859060 |    |
| 4111.9463 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4D | 3/2 | 1/2 | 7.99E+07 | 208392.26 | 232711.64 | 0.053624 |    |
| 4104.1573 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4D | 1/2 | 1/2 | 5.56E+07 | 208346.10 | 232711.64 | 0.037315 |    |
| 3857.2277 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 3/2 | 1/2 | 2.29E+07 | 206786.29 | 232711.64 | 0.015369 | ** |
| 4866.2366 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4So-4D | 3/2 | 1/2 | 1.90E+07 | 212161.88 | 232711.64 | 0.012752 |    |
| 3848.9843 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 1/2 | 1/2 | 1.45E+07 | 206730.76 | 232711.64 | 0.009732 | ** |
| 485.71731 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4D | 3/2 | 1/2 | 6.95E+06 |  26830.57 | 232711.64 | 0.004664 |    |
| 520.17866 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4D | 1/2 | 1/2 | 4.32E+06 |  40470.00 | 232711.64 | 0.002899 |    |
| 520.17328 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4D | 3/2 | 1/2 | 2.53E+06 |  40468.01 | 232711.64 | 0.001698 |    |
| 3475.9209 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2So-4D | 1/2 | 1/2 | 4.84E+05 | 203942.29 | 232711.64 | 0.000325 |    |
| 5393.2423 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4D | 1/2 | 1/2 | 6.95E+04 | 214169.92 | 232711.64 | 0.000047 |    |
| 5410.6783 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4D | 3/2 | 1/2 | 3.49E+04 | 214229.67 | 232711.64 | 0.000023 |    |
| 4719.3130 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4D | 3/2 | 1/2 | 4.08E+03 | 211522.12 | 232711.64 | 0.000003 |    |
|   36453.8 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4D | 3/2 | 1/2 | 3.76E-01 | 229968.44 | 232711.64 | 0.000000 |    |
|   432520. |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Po-4D | 1/2 | 1/2 | 1.65E-02 | 232480.44 | 232711.64 | 0.000000 |    |
|   541850. |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Po-4D | 3/2 | 1/2 | 5.10E-03 | 232527.09 | 232711.64 | 0.000000 |    |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
|           |          |                 |                 |        |     |     |   1.49e9 |           |           | 1.000000 |    |
#+TBLFM: $11=$8 / @18$8;%.6f::@18$8=vsum(@I..@II);s3

|  wav(vac) | wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |    |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
| 429.65296 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 4So-4D | 3/2 | 3/2 | 1.06E+09 |      0.00 | 232745.98 | 0.841270 |    |
| 4106.1484 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4D | 3/2 | 3/2 | 9.09E+07 | 208392.26 | 232745.98 | 0.072143 |    |
| 4121.7093 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4D | 5/2 | 3/2 | 3.20E+07 | 208484.20 | 232745.98 | 0.025397 |    |
| 3865.7628 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 5/2 | 3/2 | 1.89E+07 | 206877.86 | 232745.98 | 0.015000 | ** |
| 4858.1186 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4So-4D | 3/2 | 3/2 | 1.60E+07 | 212161.88 | 232745.98 | 0.012698 |    |
| 4098.3813 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4D | 1/2 | 3/2 | 1.48E+07 | 208346.10 | 232745.98 | 0.011746 |    |
| 3852.1254 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 3/2 | 3/2 | 1.35E+07 | 206786.29 | 232745.98 | 0.010714 | ** |
| 3843.9038 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 1/2 | 3/2 | 7.99E+06 | 206730.76 | 232745.98 | 0.006341 | ** |
| 485.58910 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4D | 5/2 | 3/2 | 3.53E+06 |  26810.55 | 232745.98 | 0.002802 |    |
| 520.08038 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4D | 3/2 | 3/2 | 2.70E+06 |  40468.01 | 232745.98 | 0.002143 |    |
| 520.08576 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4D | 1/2 | 3/2 | 5.95E+05 |  40470.00 | 232745.98 | 0.000472 |    |
| 3471.7770 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2So-4D | 1/2 | 3/2 | 2.30E+05 | 203942.29 | 232745.98 | 0.000183 |    |
| 485.63631 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4D | 3/2 | 3/2 | 2.24E+05 |  26830.57 | 232745.98 | 0.000178 |    |
| 5400.6441 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4D | 3/2 | 3/2 | 4.51E+04 | 214229.67 | 232745.98 | 0.000036 |    |
| 5383.2726 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4D | 1/2 | 3/2 | 8.85E+03 | 214169.92 | 232745.98 | 0.000007 |    |
| 4711.6774 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4D | 3/2 | 3/2 | 6.83E+03 | 211522.12 | 232745.98 | 0.000005 |    |
| 4754.3772 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4D | 5/2 | 3/2 | 6.35E+03 | 211712.73 | 232745.98 | 0.000005 |    |
|   24862.4 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Fo-4D | 5/2 | 3/2 | 3.49E-01 | 228723.84 | 232745.98 | 0.000000 |    |
|   35728.2 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4D | 5/2 | 3/2 | 1.14E-01 | 229947.07 | 232745.98 | 0.000000 |    |
|   456850. |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Po-4D | 3/2 | 3/2 | 8.29E-03 | 232527.09 | 232745.98 | 0.000000 |    |
|   376590. |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Po-4D | 1/2 | 3/2 | 4.57E-03 | 232480.44 | 232745.98 | 0.000000 |    |
|   36003.1 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4D | 3/2 | 3/2 | 1.50E-04 | 229968.44 | 232745.98 | 0.000000 |    |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
|           |          |                 |                 |        |     |     |   1.26e9 |           |           | 1.000000 |    |
#+TBLFM: $11=$8 / @24$8;%.6f::@24$8=vsum(@I..@II);s3

J_k = 5/2 and J_k = 7/2 do not seem to have a transition from ground
|  wav(vac) | wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |    |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
| 485.63258 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4D | 3/2 | 5/2 | 7.70E+08 |  26830.57 | 232747.56 | 0.523810 |    |
| 429.65004 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 4So-4D | 3/2 | 5/2 | 4.82E+08 |      0.00 | 232747.56 | 0.327891 |    |
| 4121.4407 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4D | 5/2 | 5/2 | 6.12E+07 | 208484.20 | 232747.56 | 0.041633 |    |
| 485.58537 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4D | 5/2 | 5/2 | 4.27E+07 |  26810.55 | 232747.56 | 0.029048 |    |
| 4711.3264 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4D | 3/2 | 5/2 | 4.07E+07 | 211522.12 | 232747.56 | 0.027687 |    |
| 4105.8818 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4D | 3/2 | 5/2 | 3.47E+07 | 208392.26 | 232747.56 | 0.023605 |    |
| 3865.5265 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 5/2 | 5/2 | 1.76E+07 | 206877.86 | 232747.56 | 0.011973 | ** |
| 3884.2373 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 7/2 | 5/2 | 9.06E+06 | 207002.48 | 232747.56 | 0.006163 | ** |
| 4857.7455 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4So-4D | 3/2 | 5/2 | 7.37E+06 | 212161.88 | 232747.56 | 0.005014 |    |
| 3851.8908 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 3/2 | 5/2 | 4.79E+06 | 206786.29 | 232747.56 | 0.003259 |    |
| 4754.0199 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4D | 5/2 | 5/2 | 2.05E+06 | 211712.73 | 232747.56 | 0.001395 |    |
| 520.07610 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4D | 3/2 | 5/2 | 4.83E+05 |  40468.01 | 232747.56 | 0.000329 |    |
| 5400.1830 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4D | 3/2 | 5/2 | 2.94E+04 | 214229.67 | 232747.56 | 0.000020 |    |
|   35982.6 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4D | 3/2 | 5/2 | 8.83E+03 | 229968.44 | 232747.56 | 0.000006 |    |
|   35708.0 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4D | 5/2 | 5/2 | 5.19E+02 | 229947.07 | 232747.56 | 0.000000 |    |
|   24852.6 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Fo-4D | 5/2 | 5/2 | 3.29E+02 | 228723.84 | 232747.56 | 0.000000 |    |
|   24999.3 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Fo-4D | 7/2 | 5/2 | 2.05E+01 | 228747.45 | 232747.56 | 0.000000 |    |
|   453570. |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Po-4D | 3/2 | 5/2 | 1.23E-03 | 232527.09 | 232747.56 | 0.000000 |    |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
|           |          |                 |                 |        |     |     |   1.47e9 |           |           | 1.000000 |    |
#+TBLFM: $12=$8 / @20$8;%.6f::@20$8=vsum(@I..@II);s3


|  wav(vac) | wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k | Branch |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+--------|
| 485.57062 |          | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4D | 5/2 | 7/2 | 1.50E+08 |  26810.55 | 232753.82 |        |
| 3864.5923 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 5/2 | 7/2 | 5.66E+06 | 206877.86 | 232753.82 |        |
| 3883.2940 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4D | 7/2 | 7/2 | 5.02E+07 | 207002.48 | 232753.82 |        |
| 4120.3787 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4D | 5/2 | 7/2 | 1.38E+08 | 208484.20 | 232753.82 |        |
| 4752.6069 |          | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4D | 5/2 | 7/2 | 6.89E+06 | 211712.73 | 232753.82 |        |
|   24814.0 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Fo-4D | 5/2 | 7/2 | 7.00E-01 | 228723.84 | 232753.82 |        |
|   24960.3 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Fo-4D | 7/2 | 7/2 | 6.93E+01 | 228747.45 | 232753.82 |        |
|   35628.4 |          | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4D | 5/2 | 7/2 | 1.80E+03 | 229947.07 | 232753.82 |        |
|-----------+----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+--------|
|           |          |                 |                 |        |     |     |   3.51e8 |           |           |        |
#+TBLFM: @10$8=vsum(@I..@II);s3

** Downward transitions from 3d ^4P
+ Turns out that these do *not* favor 3p ^4D_o as I thought
+ They go mainly to 3p ^4P_o and 3p ^4S_o
+ Although "mainly" is relative, since 95% go right back to ground
  + But in summary: for every pump of 3p ^4D_o we get ...
    - 7 pumps of 3p ^4P
    - 3 pumps of 3p ^4S
    - About 1 pump of doublet terms
+ Branching ratios for J_k = 5/2:
  + Ground: 96 %
  + Discounting ground:
    + 3p ^4P: 0.018005 + 0.005962 = 59.3 %
      + Lines: 4153.2977, 4169.2236
    + 3p ^4D: 0.002271 + 0.000527 + 0.000003 = *6.9 %*
      + Lines: 3907.4549, 3893.5180, 3926.5806
    + 3p ^4S: 0.012257 = 30.3 %
      + Lines: 4924.5291 (wing of He I 4922)
    + Doublet terms: 3.5 %
+ Branching ratios for J_k = 3/2:
  + Ground: 95 %
  + Discounting ground:
    + 3p ^4P: 0.022116 + 0.005026 + 0.000511 = 58.1 % 
    + 3p ^4D: 0.002646 + 0.001082 + 0.000397 = *8.7 %*
    + 3p ^4S: 0.012751 = 26.8 %
    + Doublet terms: 6.4 %
+ Branching ratios for J_k = 1/2:
  + Ground: 95 %
  + Discounting ground:
    + 3p ^4P: 0.023649 + 0.006184 = 56.5 %
    + 3p ^4D: 0.003454 + 0.001125 = *8.7 %*
    + 3p ^4S: 0.013175 = 24.9 %
    + Doublet terms: 9.9 %
*** All transitions from 3d ^4P_{5/2} sorted by branching ratio
|  wav(vac) |  wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |    |
|-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
| 430.17650 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 4So-4P | 3/2 | 5/2 | 4.04E+09 |      0.00 | 232462.72 | 0.959620 |    |
| 4154.4688 | 4153.2977 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4P | 3/2 | 5/2 | 7.58E+07 | 208392.26 | 232462.72 | 0.018005 |    |
| 4925.9038 | 4924.5291 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4So-4P | 3/2 | 5/2 | 5.16E+07 | 212161.88 | 232462.72 | 0.012257 |    |
| 4170.3988 | 4169.2236 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4P | 5/2 | 5/2 | 2.51E+07 | 208484.20 | 232462.72 | 0.005962 |    |
| 3908.5617 | 3907.4549 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 5/2 | 5/2 | 9.56E+06 | 206877.86 | 232462.72 | 0.002271 | ** |
| 486.30527 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4P | 3/2 | 5/2 | 5.69E+06 |  26830.57 | 232462.72 | 0.001352 |    |
| 3894.6212 | 3893.5180 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 3/2 | 5/2 | 2.22E+06 | 206786.29 | 232462.72 | 0.000527 | ** |
| 520.84767 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4P | 3/2 | 5/2 | 1.46E+06 |  40468.01 | 232462.72 | 0.000347 |    |
| 4775.4108 | 4774.0759 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4P | 3/2 | 5/2 | 2.46E+05 | 211522.12 | 232462.72 | 0.000058 |    |
| 5484.5450 | 5483.0215 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4P | 3/2 | 5/2 | 2.52E+04 | 214229.67 | 232462.72 | 0.000006 |    |
| 3927.6924 | 3926.5806 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 7/2 | 5/2 | 1.35E+04 | 207002.48 | 232462.72 | 0.000003 | ** |
| 486.25793 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4P | 5/2 | 5/2 | 1.20E+04 |  26810.55 | 232462.72 | 0.000003 |    |
| 4819.2790 | 4817.9325 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4P | 5/2 | 5/2 | 6.57E+03 | 211712.73 | 232462.72 | 0.000002 |    |
|   40091.7 |   40080.7 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4P | 3/2 | 5/2 | 5.00E+01 | 229968.44 | 232462.72 | 0.000000 |    |
|   26745.9 |   26738.7 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Fo-4P | 5/2 | 5/2 | 2.13E+00 | 228723.84 | 232462.72 | 0.000000 |    |
|   39751.1 |   39740.3 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4P | 5/2 | 5/2 | 7.89E-01 | 229947.07 | 232462.72 | 0.000000 |    |
|   26915.9 |   26908.6 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Fo-4P | 7/2 | 5/2 | 7.53E-02 | 228747.45 | 232462.72 | 0.000000 |    |
|-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
|           |           |                 |                 |        |     |     |   4.21e9 |           |           | 1.000000 |    |
#+TBLFM: $11=$8 / @19$8;%.6f::@19$8=vsum(@I..@II);s3
+ Surprisingly, the strongest transition is 3d ^4P \to 3p ^4P
*** All transitions from 3d ^4P_{3/2} sorted by branching ratio
|  wav(vac) |  wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |    |
|-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
| 430.04103 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 4So-4P | 3/2 | 3/2 | 3.60E+09 |      0.00 | 232535.95 | 0.952381 |    |
| 4133.9661 | 4132.8004 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4P | 1/2 | 3/2 | 8.36E+07 | 208346.10 | 232535.95 | 0.022116 |    |
| 4908.2000 | 4906.8299 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4So-4P | 3/2 | 3/2 | 4.82E+07 | 212161.88 | 232535.95 | 0.012751 |    |
| 4157.7021 | 4156.5302 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4P | 5/2 | 3/2 | 1.90E+07 | 208484.20 | 232535.95 | 0.005026 |    |
| 3883.5460 | 3882.4457 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 3/2 | 3/2 | 1.00E+07 | 206786.29 | 232535.95 | 0.002646 | ** |
| 520.64910 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4P | 3/2 | 3/2 | 7.74E+06 |  40468.01 | 232535.95 | 0.002048 |    |
| 486.08485 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4P | 5/2 | 3/2 | 6.62E+06 |  26810.55 | 232535.95 | 0.001751 |    |
| 3875.1899 | 3874.0918 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 1/2 | 3/2 | 4.09E+06 | 206730.76 | 232535.95 | 0.001082 | ** |
| 4141.8688 | 4140.7010 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4P | 3/2 | 3/2 | 1.93E+06 | 208392.26 | 232535.95 | 0.000511 |    |
| 3897.4071 | 3896.3032 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 5/2 | 3/2 | 1.50E+06 | 206877.86 | 232535.95 | 0.000397 | ** |
| 3497.2786 | 3496.2783 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2So-4P | 1/2 | 3/2 | 6.80E+05 | 203942.29 | 232535.95 | 0.000180 |    |
| 520.65450 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4P | 1/2 | 3/2 | 6.53E+05 |  40470.00 | 232535.95 | 0.000173 |    |
| 486.13216 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4P | 3/2 | 3/2 | 3.71E+05 |  26830.57 | 232535.95 | 0.000098 |    |
| 5462.6069 | 5461.0893 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4P | 3/2 | 3/2 | 1.04E+05 | 214229.67 | 232535.95 | 0.000028 |    |
| 5444.8351 | 5443.3223 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4P | 1/2 | 3/2 | 8.59E+03 | 214169.92 | 232535.95 | 0.000002 |    |
| 4802.3319 | 4800.9900 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4P | 5/2 | 3/2 | 4.94E+03 | 211712.73 | 232535.95 | 0.000001 |    |
| 4758.7703 | 4757.4399 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4P | 3/2 | 3/2 | 5.32E+02 | 211522.12 | 232535.95 | 0.000000 |    |
|   38948.3 |   38937.6 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4P | 3/2 | 3/2 | 9.27E-01 | 229968.44 | 232535.95 | 0.000000 |    |
|   38626.8 |   38616.2 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4P | 5/2 | 3/2 | 5.19E-02 | 229947.07 | 232535.95 | 0.000000 |    |
|   26232.2 |   26225.0 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Fo-4P | 5/2 | 3/2 | 2.08E-02 | 228723.84 | 232535.95 | 0.000000 |    |
|  1801500. |  1801000. | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Po-4P | 1/2 | 3/2 | 2.78E-05 | 232480.44 | 232535.95 | 0.000000 |    |
|-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
|           |           |                 |                 |        |     |     |   3.78e9 |           |           | 1.000000 |    |
    #+TBLFM: $11=$8 / @23$8;%.6f::@23$8=vsum(@I..@II);s3

*** All transitions from 3d ^4P_{1/2} sorted by branching ratio
|  wav(vac) |  wav(air) | config_i         | config_k         | Term   | J_i  | J_k  |      A_ik |   wavnum_i |   wavnum_k |   Branch |    |
|-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
| 429.91801 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 4So-4P | 3/2 | 1/2 | 3.40E+09 |      0.00 | 232602.49 | 0.947075 |    |
| 4122.6253 | 4121.4626 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4P | 1/2 | 1/2 | 8.49E+07 | 208346.10 | 232602.49 | 0.023649 |    |
| 4892.2217 | 4890.8559 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4So-4P | 3/2 | 1/2 | 4.73E+07 | 212161.88 | 232602.49 | 0.013175 |    |
| 4130.4847 | 4129.3198 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Po-4P | 3/2 | 1/2 | 2.22E+07 | 208392.26 | 232602.49 | 0.006184 |    |
| 3865.2228 | 3864.1272 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 1/2 | 1/2 | 1.24E+07 | 206730.76 | 232602.49 | 0.003454 | ** |
| 485.97495 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Do-4P | 3/2 | 1/2 | 6.42E+06 |  26830.57 | 232602.49 | 0.001788 |    |
| 520.47417 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4P | 1/2 | 1/2 | 5.24E+06 |  40470.00 | 232602.49 | 0.001460 |    |
| 3873.5359 | 3872.4382 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 4Do-4P | 3/2 | 1/2 | 4.04E+06 | 206786.29 | 232602.49 | 0.001125 | ** |
| 520.46878 |           | 2s2.2p3         | 2s2.2p2.(3P).3d | 2Po-4P | 3/2 | 1/2 | 2.18E+06 |  40468.01 | 232602.49 | 0.000607 |    |
| 3489.1587 | 3488.1604 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2So-4P | 1/2 | 1/2 | 5.79E+05 | 203942.29 | 232602.49 | 0.000161 |    |
| 5425.1789 | 5423.6712 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4P | 1/2 | 1/2 | 6.92E+04 | 214169.92 | 232602.49 | 0.000019 |    |
| 5442.8223 | 5441.3100 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Po-4P | 3/2 | 1/2 | 3.20E+04 | 214229.67 | 232602.49 | 0.000009 |    |
| 4743.7486 | 4742.4222 | 2s2.2p2.(3P).3p | 2s2.2p2.(3P).3d | 2Do-4P | 3/2 | 1/2 | 6.47E+03 | 211522.12 | 232602.49 | 0.000002 |    |
|   37964.3 |   37954.0 | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Do-4P | 3/2 | 1/2 | 3.10E-01 | 229968.44 | 232602.49 | 0.000000 |    |
|   819300. |   819100. | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Po-4P | 1/2 | 1/2 | 3.25E-03 | 232480.44 | 232602.49 | 0.000000 |    |
|  1326200. |  1325900. | 2s2.2p2.(1D).3p | 2s2.2p2.(3P).3d | 2Po-4P | 3/2 | 1/2 | 2.73E-04 | 232527.09 | 232602.49 | 0.000000 |    |
|-----------+-----------+-----------------+-----------------+--------+-----+-----+----------+-----------+-----------+----------+----|
|           |           |                 |                 |        |     |     |   3.59e9 |           |           | 1.000000 |    |
    #+TBLFM: $12=$8 / @18$8;%.6f::@18$8=vsum(@I..@II);s3


** Unwanted pumping of 3p ^4P_o
+ If we excite 3d ^4P and 3d ^4D then we will pump 3p ^4P_o more than the desired 3p ^4D_o by factor of at least 3
+ Pumping via 3d ^4D gives lines (vac): 4111.9463 (1/2 \to 3/2), 4104.1573 (1/2 \to 1/2), 4106.1484 (3/2 \to 3/2), 4121.7093 (3/2 \to 5/2), 4098.3813 (3/2 \to 1/2)
  + There are other components from 5/2 and 7/2 listed in Escalante as being partially fluoresced, but database has no pumping line for those states
  + These are seen in Manu but very weak: less than 0.1 times V1 4649
+ Pumping via 3d ^4P gives lines (air): 4153.2977 (5/2 \to 3/2), 4169.2236 (5/2 \to 5/2), etc
  + Some of these are seen quite strongly in Manu, but they also coincide with C III and He I lines
    + C III probably shouldn't be a problem except in the very center
  + About 0.03 x continuum of 20.8e-15 => about 0.3 x V1 4649
+ Altogether there are a whole bunch of lines from 4111 \to 4169 that are 3p ^4P_o - 3d ^4P or 3p ^4P_o - 3d ^4D
+ Unfortunately, He I lines block some of them
+ 4129.3198 (1/2 \to 3/2) is the most clear in Manu (no obvious blend) but it is weak
+ 4153.2977 (5/2 \to 3/2), 4156.5302 (3/2 \to 5/2) are 3x stronger than 4129.3198 but maybe contaminated by C III (or not)
*** Onwards and downwards from 3p ^4P_o
+ Roughly 60% branching ratio to 3s ^4P, which is lower level for V1
  + 4317.0, 4319.6, 4325.8 is one bunch
    + These are detected nicely in Manu
      + 4317 is strongest, getting to about 0.025 x continuum of 17.8e-15
      + Compare 4649 is 0.13 x continuum of 15.6e-15
      + So this multiplet intensity is about 0.22 x V1
  + 4345.6, 4349.5, 4366.8 is another
    + These are also seen in Manu but have interference from other lines
    + They seem to be a bit stronger though
+ Other 40% is FUV transitions to 2s 2p^4 ^4P 
